In [3]:
import pandas as pd
import numpy as np

### Series

In [5]:
obj = pd.Series([1,2,3,4,5])
obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
obj.values

array([1, 2, 3, 4, 5], dtype=int64)

In [7]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
obj2 = pd.Series([4,5,6,7],index = ['a','b','c','d'])
obj2

a    4
b    5
c    6
d    7
dtype: int64

In [9]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [10]:
obj2['a']

4

In [12]:
obj2['d']=9

In [13]:
obj2

a    4
b    5
c    6
d    9
dtype: int64

In [14]:
obj2[obj2 > 5]

c    6
d    9
dtype: int64

In [15]:
obj2 * 2

a     8
b    10
c    12
d    18
dtype: int64

In [17]:
np.exp(obj2)

a      54.598150
b     148.413159
c     403.428793
d    8103.083928
dtype: float64

In [18]:
'c' in obj2

True

In [19]:
'a' in obj2

True

### DataFrame

In [45]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
     'year': [2000, 2001, 2002, 2001, 2002, 2003],
     'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [46]:
frame = pd.DataFrame(data , columns=["year" , "state" , "pop"])

In [47]:
frame

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [18]:
frame.head()

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [48]:
frame2 = pd.DataFrame(data , columns=["year" , "state" , "pop" , "debt"] , index = ["one","two","three","four","five","six"])

In [49]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [50]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [51]:
frame2["state"]

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [52]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [53]:
frame2.loc[:,"year":"pop"]

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9
six    2003  Nevada  3.2

In [54]:
frame2['debt'] = 16

In [55]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5    16
two    2001    Ohio  1.7    16
three  2002    Ohio  3.6    16
four   2001  Nevada  2.4    16
five   2002  Nevada  2.9    16
six    2003  Nevada  3.2    16

In [56]:
frame2['debt'] = np.arange(6.0)

In [57]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [58]:
val = pd.Series([-1.2,3,5.3],index = ['two','three','five'])
val

two     -1.2
three    3.0
five     5.3
dtype: float64

In [59]:
frame2['debt'] = val

In [60]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   3.0
four   2001  Nevada  2.4   NaN
five   2002  Nevada  2.9   5.3
six    2003  Nevada  3.2   NaN

In [61]:
frame2['eastern'] = frame2['state'] == 'Ohio'

In [62]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   3.0     True
four   2001  Nevada  2.4   NaN    False
five   2002  Nevada  2.9   5.3    False
six    2003  Nevada  3.2   NaN    False

In [63]:
del frame2['eastern']

In [64]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   3.0
four   2001  Nevada  2.4   NaN
five   2002  Nevada  2.9   5.3
six    2003  Nevada  3.2   NaN

In [65]:
frame2.T

        one   two three    four    five     six
year   2000  2001  2002    2001    2002    2003
state  Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
pop     1.5   1.7   3.6     2.4     2.9     3.2
debt    NaN  -1.2   3.0     NaN     5.3     NaN